---
kind: type
id: T:Autodesk.Revit.UI.TextBoxData
source: html/36a6ad8e-237b-6ca4-07d4-3cadb1ebb6dd.htm
---
# Autodesk.Revit.UI.TextBoxData

This class contains information necessary to construct a text box in the Ribbon.

## Syntax (C#)
```csharp
public class TextBoxData : RibbonItemData
```